# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\matsuda_kazuaki\Documents\PSoC Creator\roboconn_MT_arm\roboconn_MT_arm.cydsn\roboconn_MT_arm.cyprj
# Date: Thu, 09 Jan 2014 16:52:32 GMT
#set_units -time ns
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {LIN_1_IntClk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 79 157} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {UART_1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 79 157} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 241 481} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 241 481} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]


# Component constraints for C:\Users\matsuda_kazuaki\Documents\PSoC Creator\roboconn_MT_arm\roboconn_MT_arm.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\matsuda_kazuaki\Documents\PSoC Creator\roboconn_MT_arm\roboconn_MT_arm.cydsn\roboconn_MT_arm.cyprj
# Date: Thu, 09 Jan 2014 16:52:22 GMT
