# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\takamasa\Documents\PSoC Creator\psoc3866_test.cydsn\psoc3866_test.cyprj
# Date: Sun, 11 Aug 2013 15:15:23 GMT
#set_units -time ns
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyMASTER_CLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 481 961} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_clock -name {Clock_1(fixed-function)} -period 10000 -waveform {0 5000} [get_pins {ClockBlock/dclk_glb_ff_0}]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {CyBUS_CLK(fixed-function)} -period 20.833333333333332 -waveform {0 10.4166666666667} [get_pins {ClockBlock/clk_bus_glb_ff}]


# Component constraints for C:\Users\takamasa\Documents\PSoC Creator\psoc3866_test.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\takamasa\Documents\PSoC Creator\psoc3866_test.cydsn\psoc3866_test.cyprj
# Date: Sun, 11 Aug 2013 15:15:18 GMT
